nodePerformance/perftests/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 15
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 100
      arrivalRate: 50
      name: Sustained load
scenarios:
  - flow:
    - get:
        url: "/"